[
    {
        "id":12,
        "group":"side",
        "title":"Yogurt Cucumber Sauce with Rose Petals (Maast-o Khiar)",
        "imgUrl":"https://www.saveur.com/app/uploads/2019/03/14/O5Q6RWA6W37BIAJ6DE35LHJR6M-768x1024.jpg",
        "disc":"The use of roses—petals and waters flavored with them—is common in Persian and Middle Eastern kitchens. Naz sprinkles the petals atop this tart, cooling yogurt sauce she serves with crispy rice dishes, and often with stews and meats",
        "recipe":{"yield":"","Ingredients":" Dried rose petals & 2 cups plain Greek yogurt & 1 1⁄4 cups grated cucumber & 1 tbsp. dried mint, plus more for sprinkling & Kosher salt and freshly ground black pepper",
        "Instructions":"Lightly grind some rose petals between your fingers, and measure out ¼ teaspoon. In a medium bowl, whisk together yogurt, cucumber, mint, and the ground rose petals. Season generously with salt and pepper. Serve immediately, topped with a sprinkling of more rose petals and mint. Or the sauce can be refrigerated, covered, for up to 3 days; garnish just before serving. (If the sauce becomes runny, stir in a little more yogurt to thicken it.)"}
      },
      {
        "id":13,
        "group":"side",
        "title":"Torshi Seer",
        "imgUrl":"https://www.saveur.com/app/uploads/2019/02/08/GQGPN4GEUIUSGKKBSXBJSTAMFE.jpg",
        "disc":"For this sweet-tart Persian pickle, whole heads of garlic are fermented in a vinegar solution until the cloves are very soft.",
        "recipe":{"yield":"makes About 4 Cups","Ingredients":"4 heads garlic & 1 cup balsamic vinegar & 1 cup red wine vinegar & 1⁄3 cup dried barberries & 2 tbsp. honey & 2 tsp. salt & 2 sprigs thyme",
        "Instructions":"Place garlic in a sterilized 1-qt. glass jar; set aside. Bring balsamic and red wine vinegars, barberries, honey, salt, and thyme to a boil in a 2-qt. saucepan; pour over garlic, place lid on jar, and let cool to room temperature. Store in a cool, dark place for at least 6 weeks before serving."}
      },
      {
        "id":14,
        "group":"pastry",
        "title":"Rice Cookies",
        "imgUrl":"https://www.saveur.com/app/uploads/2019/02/08/EA24VE5DX67TUGGKJOI2SHMJMY.jpg",
        "disc":"These crumbly rice flour cookies are made using a sugar syrup infused with rose water, a classic ingredient in Middle Eastern sweets.",
        "recipe":{"yield":"makes About 90 Cookies" , "Ingredients":" 3⁄4 tsp. sugar & 1 egg yolk & 1 cup rice flour & 1⁄3 cup clarified butter or ghee & 2 1⁄2 tbsp. canola oil & 1⁄2 tsp. cardamom powder & 1⁄4 cup syrup & 1 tbsp. poppy seeds",
        "Instructions":"Make the syrup: Combine sugar and ¼ cup water in a 1-qt. saucepan over high; stir until sugar has dissolved, about 3 minutes. Remove from heat and add rosewater. Cool until ready to use. & Make the cookies: Heat oven to 350°. Combine sugar and yolk in a bowl and beat with a hand mixer until creamy; set aside. In another bowl, combine rice flour, clarified butter, oil, and cardamom; add yolk mixture and mix until evenly combined. Add syrup and mix until combined. Set aside to cool. Roll dough into ⅛ oz. balls, about ¾” thick, and place on parchment paper-lined baking sheets. Gently flatten each ball; using the grooved sides of a meat mallet (alternatively, use a fork), press grooves into cookies to create a pattern. Sprinkle with poppy seeds and bake, rotating halfway through, until cooked, about 10 minutes. Allow to cool on the baking sheets as cookies are quite delicate while hot."}
      },
      {
        "id":15,
        "group":"pastry",
        "title":"Almond Cake with Saffron and Rose Water",
        "imgUrl":"https://www.saveur.com/app/uploads/2019/03/27/65IZ6T5ARWV7AMI6YLUQWMFHEU-1024x768.jpg",
        "disc":"Diamonds of this floral, marzipan-like cake are crowned with a crunchy, aromatic mixture of pistachios and cardamom.",
        "recipe":{"yield":"","Ingredients":"Canola oil, for greasing & 2 cups (14 oz.) sugar & ½ tsp. finely ground saffron & 3 tbsp. rose water & 9¼ cups (2 ¼ lb.) blanched almond flour, sifted & 2 tbsp. finely chopped pistachios & 1 tsp. freshly ground cardamom seeds",
        "Instructions":"Lightly grease a 9½x13-inch baking pan or rimmed baking sheet with oil, then line with parchment paper and lightly grease the paper. & In a small pot, bring the sugar and 1 cup water to a boil over medium-high heat. Remove from the heat, add the saffron and rose water, and stir well until the sugar has dissolved. Set aside to cool completely. & Transfer the syrup to a stand mixer fitted with the whisk attachment. Beat on high speed until it is foamy and thickened, about 3 minutes. Using a rubber spatula, gradually fold in the almond flour and mix until you have a thick, homogeneous paste. Transfer the paste to the prepared pan, place a sheet of greased parchment paper on top (oiled side down), and use your hands to flatten the paste. (It should be about 2 inches thick.) Using a rolling pin, flatten the paste further and even out the surface, then transfer to the fridge (still covered with parchment paper) for at least 24 hours or up to 3 days. & Oil a long knife, then cut the cake into 25 diamond-shaped pieces. In a small bowl, stir together the pistachios and cardamom, then garnish each diamond with a generous pinch of the pistachio mixture. Serve immediately, or transfer in a single layer to an airtight container or cover tightly with plastic wrap, refrigerate, and serve within 1 week."}
      },
  {
    "id":1,
    "group":"soup",
    "title":"Noodle Soup (Ash-e Reshteh)",
    "imgUrl" : "https://www.saveur.com/app/uploads/2019/02/08/XO5FDD6YFGPZ4JW44VREIEZ2OE-1024x768.jpg" ,
    "disc": "This spiced vegetable soup is made with reshteh, Iranian noodles.",
    "recipe" : {"yield": "serves 6-8" , "Ingredients" : "1⁄2 cup canola oil & 2 onions thinly sliced & 1⁄2 cup each dried kidney and cannellini beans chickpeas, soaked overnight drained & 1 1⁄2 tbsp ground turmeric & Kosher salt and freshly ground black pepper to taste & 6 cups chopped spinach & 1 cup chopped parsley & 1⁄2 cup brown lentils & 1 bunch chives finely chopped & 2 cups reshteh or dried linguini & 8 cloves garlic thinly sliced & 2 tbsp dried mint & 1⁄4 cup powdered whey optional; see recipe, mixed with 4 tbsp. water",
    "Instructions" : "Heat 1⁄4 cup oil in an 8-qt. saucepan over medium-high heat. Add onions, and cook until caramelized, about 20 minutes. Transfer half the onions to a bowl; set aside for garnish. Add all beans, turmeric, and salt and pepper to onions in pan; cook, stirring, for 5 minutes. Add 12 cups water; bring to a boil. Reduce heat to medium-low; cook, covered, until beans are barely tender, about 50 minutes. Add spinach, parsley, lentils, and chives; cook for 20 minutes. Add noodles, and cook until noodles and beans are tender, about 12 minutes more.&Meanwhile, heat remaining oil in a 10″ skillet over medium-high heat. Add garlic; cook until lightly browned and crisp, about 3 minutes. Using a slotted spoon, transfer to paper towels to drain. Return skillet to heat and add mint; cook until fragrant, about 1 minute. Ladle soup into bowls; top with reserved caramelized onions and garlic chips, then drizzle with the mint oil and whey."
    }
  },
  {
    "id":2,
    "group":"soup",
    "title": "Chicken Meatball Soup (Gundi)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/02/08/E4CNKO4CKJ4NML3CQXLGKJKZ5E.jpg",
    "disc":"At the heart of this intriguing soup is a matzo-ball-like dumpling made of ground chicken and chickpea flour.",
    "recipe":{"yield":"serves 6","Ingredients":"1⁄4 cup canola oil & 1 lb. chicken wings & Kosher salt and freshly ground black pepper, to taste & 3 medium onions (2 roughly chopped, 1 minced) & 3 medium carrots, roughly chopped & 2 cloves garlic, crushed & 8 cups chicken stock & 1 bay leaf & 1 1⁄2 lb. ground chicken & 1 1⁄2 cups chickpea flour & 2 1⁄2 tsp. ground turmeric & 2 tsp. ground coriander & 1 1⁄2 tsp. baking soda & 1⁄2 tsp. ground cardamom",
    "Instructions":"Heat 3 tbsp. oil in an 8-qt. saucepan over medium-high heat. Season wings with salt and pepper; cook, turning once, until browned, about 13 minutes. Add roughly chopped onions, carrots, and garlic, and cook, stirring, until soft, about 8 minutes. Add stock, bay leaf, and salt; bring to a boil. Reduce heat to medium; cook until slightly reduced, about 25 minutes. Strain broth, discard solids, and return broth to pan. & Meanwhile, heat remaining oil in a 12″ skillet over medium-high heat. Add minced onion; cook until soft, 3–4 minutes. Transfer to a bowl and mix with remaining ingredients. Using wet hands, divide mixture into six 3″ balls. Bring broth to a simmer; add meatballs. Cook, partially covered, until cooked through, about 17 minutes. To serve, divide broth and meatballs among 6 bowls."}
  },
  {
    "id":3,
    "group":"entree",
    "title": "Tamarind-Stuffed Fish",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/02/08/VWK5QXQXNQDRTGHQGR3PR32C6M-1024x768.jpg",
    "disc":"A luxurious whole fish preparation flavored with tangy tamarind and fragrant barberries, perfect for Nowruz, the Persian new year. Find barberries in well-stocked Middle Eastern groceries",
    "recipe":{"yield":"serves 4" , "Ingredients":" 6 tbsp. olive oil, plus more for greasing & 1⁄2 cup barberries & 1 large yellow onion, thinly sliced & 1⁄4 cup tamarind paste & 4 garlic cloves, minced & 1⁄3 cup minced cilantro & 1⁄3 cup minced parsley & 1⁄3 cup minced tarragon & Lime wedges, for serving & 4 trout, cleaned and butterflied & Kosher salt and freshly ground black pepper",
    "Instructions":"Heat oven to 375°. Grease two baking sheets and set aside. & Soak barberries in warm water for 30 minutes and drain. & In a large skillet over medium-high, heat 3 tablespoons olive oil. Add the onions and cook until brown, about 10 minutes. Lower the heat to medium and cook, stirring occasionally, for 30 minutes more, until dark brown and caramelized. Add the barberries, almonds, tamarind, and garlic, and cook until fragrant, about 10 minutes. Remove from heat and stir in cilantro, parsley, and tarragon. & Season fish with salt and pepper. Stuff each fish with about 1⁄2 cup stuffing and brush with remaining olive oil. Bake for 15 minutes. Change oven setting to broil and cook an additional 3 to 4 minutes, until the fish’s skin is golden."}
  },
  {
    "id":4,
    "group":"entree",
    "title":"Steamed Saffron Rice with Tahdig (Chelo ba Tahdig)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/03/11/WSVNQHIRDDTVZHYCGAMFEB5ZCM-1024x768.jpg",
    "disc":"Iranians usually serve chelo ba tahdig with stew, kebabs, or meat dishes. Herbs and alliums, feta, or walnuts often share the table.",
    "recipe":{"yield":"serves 6","Ingredients":" 3 cups (1 lb. 4 oz.) extra-long white basmati rice & 1⁄4 cup plus 2 Tbsp. kosher salt, divided & 1⁄4 tsp. saffron, lightly ground between your fingers & 1⁄4 cup clarified unsalted butter, divided & 1 tbsp. extra-virgin olive oil, plus more as needed" ,
    "Instructions":"In a large bowl, add the rice and enough water to cover by several inches. Gently swish the rice around, then drain. Repeat until the water runs clear, about 5 rinses, then drain completely. Return the rice to the bowl. Cover the rice with 2 cups fresh cold water, add 2 tablespoons kosher salt, and stir gently to dissolve. Let the rice soak at room temperature for 1 hour. & In a 10-inch, flat-bottomed, nonstick pot, bring 12 cups of water to boil over high heat. Add ¼ cup kosher salt and stir to dissolve. Drain the rice (don’t rinse it), and add it to the pot. Stir once gently, and don’t go anywhere (the water can boil over very easily). Spoon away and discard any foam that rises to the top. As soon as you see the first grain of rice pop up, set a timer for 4 minutes and place a large, fine-mesh strainer in the sink. Start taste-testing the rice at 4 minutes. When the grains are tender on the outside with a little bite on the inside, 5–7 minutes, drain and quickly rinse with lukewarm tap water. (Use the spray option on your faucet if you have one; if not, place your hand under the tap and create a spray with your fingers.) Wash and dry the pot and return it to the stove. & Bring a small amount of water to boil; remove and let rest for 5 minutes. In a small heatproof bowl, add the saffron and ¼ cup of the hot water. Set aside. & Place the colander of drained rice by the stove. Set the rice pot over medium heat and add 2 tablespoons of the clarified butter, the olive oil, and 1 tablespoon of the saffron water. Cook until the butter is melted, then lift the pot and swirl the fats around so they evenly cover the bottom of the pot and a little up the sides, adding another tablespoon or two of oil as needed to coat the bottom in a very thin layer. Work quickly now: As soon as the oil starts to sizzle, immediately add enough rice to fully cover the bottom of the pot in a thin layer (about 3 cups). Pack the rice down with a spatula (this will become your tahdig layer). Gently scatter the remaining rice over the tahdig, mounding it slightly in the center and making sure that the entire tahdig layer is covered with more rice. With the handle of the spatula, poke a few holes in the rice without hitting the tahdig layer, to allow steam to escape. Turn the heat up to medium-high, cover the pot, and cook for 10–12 minutes to allow the tahdig to set. & Meanwhile, in a small pot, gently melt the remaining 2 tablespoons of clarified butter. Add the remaining saffron water, and keep warm. & When the 10–12 minutes are up, lift the rice pot lid, taking care not to drip the condensation trapped under the lid back into the rice, then drizzle the butter mixture over the rice. Wrap the lid in a kitchen towel or a couple of layers of paper towels to catch the condensation. (Make sure the kitchen towel or paper towels are secured on top so they don’t catch fire.) Return the lid to the pot, adjust the heat to medium, and cook until steam begins to escape from the edges of the lid, about 10 minutes. Lower the heat to medium-low and continue cooking, rotating the pot a few times for even crisping, until the rice is tender and fluffy and the tahdig is crispy and golden, 30–40 minutes. (It’s tricky to check for doneness, but look for the rice on the sides of the pot to appear dry and set.) & To help release the tahdig, fill the sink with about 1 inch of cold water, and dip the bottom of the rice pot in the water quickly. (Alternatively, wet a kitchen towel and set the pot atop the wet towel.) To serve, you can scatter the rice across a platter and serve the tahdig whole or in pieces on the side. Or, place an appropriately sized flat plate or platter over the pot, take a deep breath, and quickly and confidently flip the pot over. You should hear a swish when the tahdig releases. Remove the pot, and serve immediately."}
  },
  {
    "id":5,
    "group":"entree",
    "title":"Kuku Sabzi",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/01/16/R2FL55HMXTZNKX7U75S4YEYS4U-1024x769.jpg",
    "disc":"A classic Persian herb-loaded egg dish with the fragrant lift of rose petals",
    "recipe":{"yield":"serves 6" , "Ingredients":" 3 tbsp. olive oil & 1⁄2 cup finely ground walnuts & 2 tsp. crushed dried rose petals & 2 garlic cloves, minced & 1 cup tightly packed cilantro, finely chopped & 1 cup tightly packed parsley, finely chopped & 1 bunch scallions, finely chopped & 8 eggs, lightly beaten & Kosher salt and freshly ground black pepper",
    "Instructions":"Heat oven to 350°. In a 10-inch nonstick, oven-proof skillet, heat the oil. Add the walnuts, rose petals, and garlic and cook until fragrant, about 4 minutes. Add the herbs and scallions and cook until wilted, 2 minutes more. Add the eggs, salt, and pepper and transfer the skillet to the oven. Bake for 15 minutes or until the frittata springs back lightly when touched. Cool slightly before transferring to a serving platter. Serve warm or at room temperature."}
  },
  {
    "id":6,
    "group":"entree",
    "title":"Baked Saffron Yogurt Rice with Chicken (Tahcheen-e Morgh)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/03/11/SI4KF6ISWT2J7XCCEZRWOH7DFY-1024x768.jpg",
    "disc":"Bake this tahcheen, a saffron rice with chicken, in a clear glass baking dish so you can check on the crisping of the rice’s bottom layer.",
    "recipe":{"yield":"serves 8","Ingredients":" 3 cups extra-long white basmati rice (1 lb. 4 oz.) & 1⁄4 cup plus 2 Tbsp. kosher salt, divided, plus more as needed & 1⁄4 tsp. saffron, lightly ground between your fingers, plus more for sprinkling & 3 tbsp. extra-virgin olive oil & 1 large yellow onion, halved and sliced ¼-inch-thick & 4 medium garlic cloves, finely chopped (1 Tbsp.) & 10 boneless, skinless chicken thighs (2 lb. 3 oz.), halved & 1⁄4 tsp. freshly ground black pepper & 1⁄4 cup fresh lemon juice & 1 cup plain whole-milk Greek yogurt & 1 large egg & 5 tbsp. unsalted butter, divided",
    "Instructions":"Parboil the rice by following steps 1 and 2 of the Steamed Saffron Rice with Tahdig recipe (p. 36). Set the rice aside to drain as you prepare the dish’s other components. & In a small bowl, add the saffron and 2 tablespoons hot water. (Be sure to pre-soak your barberries now, too. See toppings list.) & In a large, deep skillet, add the olive oil and set over medium heat. Once hot, add the onion and ¼ teaspoon salt, and cook, stirring occasionally, until soft and golden, about 20 minutes. Add the garlic and cook until fragrant, 2 minutes. Add the chicken thighs, 2¾ teaspoons salt, and the pepper. Cook, turning the chicken as needed, until the pieces begin to brown slightly, about 6 minutes total. Add the lemon juice and saffron water, and turn the chicken to coat well. Lower the heat to medium-low, partially cover the pot, and let simmer, stirring occasionally, until the chicken is tender and just cooked through, 20–25 minutes. Remove from the heat and let cool slightly. Cut the chicken into ½-inch-long strips, return them to the pan, and toss to coat in the onions and pan juices. Remove the pan from the heat and set aside while you finish the rice. & Preheat the oven to 400°F and set a rack in the lowest position. & In a large bowl, combine the yogurt, egg, and a tiny pinch of ground saffron. Add half of the rice and stir well to combine. Set the mixture aside. & In a 9-by-13-inch glass baking dish (preferably clear), add 3 tablespoons of butter; set the dish in the oven to melt the butter, about 3 minutes. Remove the dish, swirling the melted butter all over the bottom and sides. Spread the yogurt-rice mixture evenly along the bottom of the dish, packing it down firmly. Add the chicken pieces evenly over the rice, then sprinkle the remaining plain rice over the chicken in an even layer. Drizzle with 2 tablespoons of chicken juices and dot with the remaining 2 tablespoons of butter. Cover tightly with aluminum foil, transfer to the oven, and bake until the bottom of the rice is crispy and golden, 80–90 minutes. (If using a clear glass dish, carefully lift it to check the bottom.) Remove the baking dish and let the rice rest at room temperature for 5 minutes. & While the tahcheen rests, prepare the topping: In a small pot, melt the butter over medium heat. Stir in the drained barberries, pistachios, and sugar (if using), and cook until the berries are just plumped, about 2 minutes. Remove from the heat. & Run a knife along the sides of the baking dish to help release the rice. Place a large rectangular serving platter, baking tray, or cutting board over the tahcheen, take a deep breath, and quickly and confidently flip the baking dish over to unmold. You should hear a swish when the tahdig releases. Remove the baking dish and sprinkle the crispy surface of the rice with the barberry topping. Cut into pieces and serve."}
  },
  {
    "id":7,
    "group":"entree",
    "title":"Lentil Rice with Lavash Tahdig (Adas Polo)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/03/11/L2N233EB3VWQE43J7IJHYBS3Z4-1024x768.jpg",
    "disc":"A thin layer of lavash bread can be cooked beneath the rice to serve as a tahdig. Press it flat against the pot for even cooking",
    "recipe":{"yield":"serves 6","Ingredients":" 2 cups (13 1/3 oz.) extra-long white basmati rice & 6 tbsp. plus 1 tsp. kosher salt, plus more as needed & 1⁄2 tsp. saffron, lightly ground between your fingers & 1 cup green or brown lentils, picked, rinsed, and drained & 1⁄4 cup plus 2 Tbsp. clarified unsalted butter, divided & 1 medium yellow onion, finely chopped (1 cup) & 6 medjool dates, pitted and coarsely chopped (4 oz.) & 1 cup (5½ oz.) golden or brown raisins, plus more for garnish if desired & 1⁄2 tsp. ground cinnamon & 2 tsp. ground cumin & One large piece lavash bread & 1 tbsp. extra-virgin olive oil, plus more as needed",
    "Instructions":"Parboil the rice by following steps 1 and 2 of the Steamed Saffron Rice with Tahdig recipe. Set aside the rice to drain at room temperature as you prepare the dish’s other components. & Meanwhile, soak the saffron in ¼ cup plus 3 tablespoons hot water. Set aside. & In a medium pot, add the lentils, 2 cups cold water, and 1 teaspoon kosher salt. Partially cover the pot and bring to a boil over high heat, then lower the heat to medium-low and cook, stirring occasionally, until all or most of the water has evaporated and the lentils are softened but not completely cooked through, about 20 minutes. (If the lentils are ready but there’s still water in the pot, drain them well; if the water is absorbed but the lentils aren’t ready yet, add a little more water and cook a few minutes longer.) Set aside. & Meanwhile, in a medium pot, melt 2 tablespoons of clarified butter over medium-high heat; add the onion and cook, stirring occasionally, until softened and golden, about 12 minutes. Lower the heat to medium-low, then add the dates, raisins, cinnamon, and 3 tablespoons of the saffron water. Season with a pinch of salt and cook, stirring occasionally, until the dried fruits have absorbed most of the liquid, about 3 minutes. Remove the pot from the heat and partially cover it; set aside to cool slightly. & Transfer the drained, parboiled rice to a large bowl; add the lentils, the dried fruit mixture, and the cumin, and stir gently with your hands, taking care not to break the grains. Set this mixture by the stove. & Cut around the edges of the lavash bread so that it fits the bottom surface of an 8- to 10-inch-wide, shallow, nonstick pot and comes just slightly up the sides. Set the pot over medium heat and add 2 tablespoons of the clarified butter, the olive oil, 1½ teaspoons of the saffron water, and a pinch of salt. As the butter melts, swirl the mixture around so that it evenly covers the bottom of the pot in a thin layer and comes a little up the sides, adding another tablespoon or two of oil as needed to coat the bottom in a very thin layer. Working quickly, press the lavash onto the bottom of the pot, patching any gaping spots with leftover lavash. Gently ­scatter the rice, lentil, and dried fruit mixture over the bread, mounding it slightly in the center but making sure that the lavash is completely covered with the mixture. With the handle of a wooden spoon, poke a few holes into the rice without hitting the lavash to allow some steam to escape. Cover the pot and cook until you see steam escaping out the sides of the lid, 10–12 minutes. & Meanwhile, in a small pot, melt the remaining 2 tablespoons of butter and add it to the remaining saffron water. Lift the rice pot lid without dripping the condensation trapped under the lid back into the pot and drizzle the butter-water-saffron mixture over the rice. Wrap the lid in a kitchen towel or a couple of layers of paper towels to catch any condensation, then place the lid firmly back on the pot. (Make sure the kitchen towel or paper towels are secured on top so they don’t catch fire.) Lower the heat to medium-low and cook, rotating the pot a few times for even crisping, until the rice is tender and fluffy and the tahdig is crispy and golden, about 35 minutes. (It’s tricky to check for doneness, but look for the rice on the sides of the pot to appear dry and set.) & Work quickly to avoid burning the lavash: To serve the rice with lavash on top, place an appropriately sized flat plate over the pot (this will be your serving plate). Take a deep breath, and quickly and confidently flip the pot over. You should hear a swish when the tahdig releases. Remove the pot. Garnish the lavash with extra dried fruit if desired. Use a serrated or sharp knife to cut wedges through the lavash and serve them with the rice portions, if desired. Alternatively, scatter the rice across a platter and serve the tahdig cut into pieces on the side."}
  },
  {
    "id":8,
    "group":"entree",
    "title":"Herbed Rice with Fish Tahdig (Sabzi Polo ba Tahdig-e Mahi)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/03/11/GLR3VDZ3MUQ4752LFSIPMJ5QWY-1024x768.jpg",
    "disc":"Have a fishmonger remove the branzino’s spine and ribs, to make the fish more malleable and prevent bones from sneaking into the rice.",
    "recipe":{"yield":"serves 6","Ingredients":" 2 1⁄2 cups (1 lb. 1 oz.) extra-long white basmati rice & 1⁄4 cup plus 3 Tbsp. kosher salt, or more as needed & 1⁄4 tsp. saffron, lightly ground between your fingers & 2 cups finely chopped dill, divided & 2 1⁄4 cups finely chopped cilantro leaves & 2 1⁄4 cups finely chopped Italian parsley leaves & 1⁄2 cup plus 2 Tbsp. finely chopped chives & 1⁄4 cup dried dill (optional) & 2 tsp. dried fenugreek leaves (optional) & Two 1-lb. whole branzino, scaled, cleaned and butterflied by your fishmonger, fins removed & 1⁄4 cup plus 3 Tbsp. extra-virgin olive oil, divided & 1⁄4 cup plus 2 Tbsp. clarified unsalted butter & Freshly ground black pepper & 1 tbsp. finely grated lemon zest & 3 medium garlic cloves, thinly sliced (1 Tbsp.) & 2 tsp. fresh lemon juice, plus more as needed",
    "Instructions":"Parboil the rice by following steps 1 and 2 of the Steamed Saffron Rice with Tahdig recipe (p. 36). Set aside the rice to drain at room temperature as you prepare the dish’s other components. & In a small bowl, add the ground saffron and ¼ cup of hot water. Set aside. & In a medium bowl, combine all but 1 tablespoon of the fresh dill with all of the cilantro, parsley, chives, and dried dill and fenugreek, if using. Set aside 2 cups of plain cooked rice. Add the remaining rice to the herb mixture and fold them together gently with your hands, taking care not break the rice grains. Taste the mixture and season it with more kosher salt, if desired. Set the mixture aside. & Season both fish inside and out with the ¼ cup olive oil and a generous amount of salt and black pepper. Stuff the cavities with the lemon zest, garlic, and reserved fresh dill, then drizzle each with 1 teaspoon fresh lemon juice. Close the cut sides of the fish back up, and set them near the stove. & In a 10- to 12-inch nonstick pot set over medium-high heat, melt ¼ cup clarified butter with 3 tablespoons of olive oil and 1 tablespoon of the saffron water. When the mixture is sizzling, add the fish. (The fish should sizzle audibly as soon as it hits the hot fat.) Fry undisturbed until the skin on one side starts to crisp, about 5 minutes. Separate the fish to opposite sides of the pan, and quickly scatter the plain reserved white rice over the fish, gently patting the rice down around the sides. & Cover the fish and the plain rice with the herbed rice (this will prevent the herbs from burning against the bottom of the pan). With the handle of a wooden spoon, poke a few holes in the rice, without hitting the fish-tahdig layer. Cover the pot and continue cooking on medium-high heat until the tahdig is set, 8–10 minutes. & Meanwhile, in a small pot, melt the remaining 2 tablespoons of clarified butter and add it to the remaining saffron water. Lift the lid from the rice pot, taking care not to drip the condensation trapped under the lid back into the rice mixture. Drizzle the butter-­saffron mixture all over the rice. Wrap the lid in a kitchen towel or a couple of layers of paper towels to catch the condensation. (Make sure that the kitchen towel or paper towels are secured on top so that they don’t catch fire on the stove.) Place the lid back onto the pot, turn the heat down to medium, and cook until steam begins to escape from the sides of the pot, about 10 minutes. Turn down the heat to medium-low and continue cooking, rotating the pot a few times for even crisping of the tahdig, until the rice is tender and fluffy, the fish is cooked through, and the tahdig is crispy and golden, 30–35 minutes. & To help release the tahdig, fill the sink with about 1 inch of cold water, and dip the bottom of the rice pot in the water briefly. (Alternatively, you can wet a kitchen towel with cold water and set the pot on top of the wet towel.) Place an appropriately sized flat dish over the pot (this will be your serving dish). Take a deep breath, and quickly and confidently flip the pot over to unmold the rice and tahdig. You should hear a swish when the tahdig releases. Carefully remove the pot, and serve immediately."}
  },
  {
    "id":9,
    "group":"entree",
    "title":"Lamb Meatballs with Carrots and Potatoes (Koufteh Ghelgheli)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/03/28/2XB2ZZ4RY2D6FWUNS3SRSI3MMM-768x1024.jpg",
    "disc":"Turmeric does double duty here: it goes into the lamb meatballs as well as the lemony broth they’re cooked in",
    "recipe":{"yield":"serves 4","Ingredients":"1 lb. ground lamb & 2 medium yellow onions, one finely grated (1¼ cup), and one finely chopped (2 cups), divided & ⅓ cups chickpea flour & 2 tbsp. kosher salt, divided & 3 tbsp. ground turmeric, divided & 4 tsp. freshly ground black pepper, divided & ¼ cups vegetable oil & ½ cups fresh lemon juice & 4 medium carrots (1 lb. 5 oz.), peeled and cut into 1-inch cubes & 2 medium yellow potatoes (10 oz.), peeled and cut into 1-inch cubes",
    "Instructions":"In a large bowl, add the lamb, grated onion, chickpea flour, 1 tablespoon salt, 1 tablespoon turmeric, and 2 teaspoons pepper. Use your hands to mix well, then shape into balls about 1 inch in diameter (You should have about 33 meatballs, weighing ¾ ounce each). Set aside while you make the sauce. & In a large skillet set over medium heat, add the oil. When the oil is hot, add the chopped onions and the remaining 1 tablespoon salt and cook, stirring occasionally until the onions are soft and just beginning to turn golden, 15–18 minutes. Add the remaining 2 tablespoons turmeric and continue cooking, stirring until completely combined, about 1 minute. Add 3 cups cold water and increase the heat to medium-high. Add the lemon juice and remaining 2 teaspoons pepper. Bring to a boil, then regulate the heat to maintain a strong simmer. Gently add the meatballs and cook for 5 minutes, then gently stir in the carrots and potatoes. Bring back to a boil, then lower the heat to low and simmer until the meatballs are cooked through, the vegetables are tender when poked with a fork, and the sauce is thickened, about 1 hour. Serve immediately."}
  },
  {
    "id":10,
    "group":"entree",
    "title":"Veal and Kidney Bean Stew (Ghormeh Sabzi)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/03/18/YAVXDTPJYYTIOO7LJPUTAAYSUI-1024x768.jpg",
    "disc":"Fenugreek, an aromatic dried herb, lends a distinctly floral flavor to hearty veal stew",
    "recipe":{"yield":"serves 4-6","Ingredients":" 1⁄4 cup canola oil & 1 lb. veal shoulder, cut into 1″ cubes & Kosher salt and freshly ground black pepper, to taste & 1 tbsp. ground turmeric & 1 large yellow onion, minced & 2 cups minced parsley & 1 1⁄2 cups minced cilantro & 2 bunches scallions, minced & 2 cups dried kidney beans, soaked overnight, drained & 1 1⁄2 tbsp. dried fenugreek & 4 dried black limes & Lavash or pita, for serving",
    "Instructions":"Heat oil in a 6-qt. saucepan over medium-high heat. Season veal with salt and pepper. Add to pan; cook, turning, until browned all over, about 8 minutes. Transfer to a plate; set aside. Add turmeric and onion; cook until softened, about 10 minutes. Add parsley, cilantro, and scallions; cook until dark green, about 8 minutes. Return veal to pan with beans, fenugreek, limes, and 4 cups water; boil. Reduce heat to medium-low; cook until limes have softened, about 10 minutes. Pierce 2 limes with a paring knife; cook, partially covered, until veal is tender, about 1½ hours. Serve with lavash."}
  },
  {
    "id":11,
    "group":"entree",
    "title":"Stuffed Grape Leaves (Dolmeh)",
    "imgUrl":"https://www.saveur.com/app/uploads/2019/03/18/J4INPTDEH7SZTJKRZ47ZO3XWUQ.jpg",
    "disc":"Grape leaves are stuffed with a beef, herb, and rice mixture in this slightly-sweet version of Iranian dolmeh",
    "recipe":{"yield":"serves 4","Ingredients":"1⁄4 cup olive oil & 1 cup diced yellow onion & 1⁄2 scallions, chopped & 2 cloves (about 1 tablespoon) garlic, peeled and finely chopped & 1 lb. ground beef & 1⁄3 cup split green peas & 2⁄3 cup basmati rice, rinsed & 1⁄2 cup fresh dill, finely chopped & 1⁄2 cup fresh tarragon, finely chopped & 1 tsp. ground cinnamon & 1⁄4 tsp. saffron threads & Grape leaves, rinsed and stem removed & 1⁄2 cup freshly squeezed lemon juice & 1⁄4 cup sugar",
    "Instructions":"Make the filling: Heat the oil in a 12-inch saucepan. Add onions, scallions, and garlic and cook until soft, about 4 minutes. Add the beef and cook until browned, another 4 minutes. Add saffron, dill, and tarragon and season with salt and pepper. Add peas and rice along with 2 cups water. Cover and cook until water is absorbed, about 35-45 minutes. Remove from heat. Stir in chopped parsley and cinnamon. & Working with one leaf at a time, flatten leaf and place about 2 tablespoons rice mixture in center. Fold bottom of leaf over filling, fold in sides, and roll into tight cylinder. Lay extra leaves over bottom of a 6-quart dutch oven, and then tightly layer dolmeh, seam-side down, on top. In a small bowl, combine lemon juice and sugar, and pour over the dolmeh. Cover tightly. Cook at medium-low heat for 45 minutes. Allow to cool before serving, preferably in the fridge overnight."}
  }
]